# 4th July Pandas

In [ ]:
# Library for python 
# dask advanced version of pandas

In [2]:
import pandas as pd # to import pandas library

# pd - alias

In [4]:
# to read csv files

df = pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Coffee_Chain.csv")

In [5]:
type(df) # to check the datatype of the dataframe

pandas.core.frame.DataFrame

In [9]:
df.head() # to get the few records or rows of the dataset

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
0,02/01/2002,West,California,Major Market,Coffee,Amaretto,Regular,441,-87,86,305,158,102,1986,-61,101,456,402
1,02/01/2002,West,California,Major Market,Espresso,Caffe Latte,Regular,1527,477,737,647,267,213,4492,478,685,1212,686
2,02/01/2002,West,California,Major Market,Espresso,Caffe Mocha,Regular,898,83,513,350,436,360,2048,89,458,775,312
3,02/01/2002,West,California,Major Market,Smoothie,Chocolate,Decaf,681,322,451,285,107,83,2309,332,350,667,263
4,02/01/2002,West,California,Major Market,Coffee,Columbian,Regular,2064,786,1164,776,471,257,6601,1056,1494,2694,930

In [11]:
df.head(2) # mentioning the number will show that particular number of records

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
0,02/01/2002,West,California,Major Market,Coffee,Amaretto,Regular,441,-87,86,305,158,102,1986,-61,101,456,402
1,02/01/2002,West,California,Major Market,Espresso,Caffe Latte,Regular,1527,477,737,647,267,213,4492,478,685,1212,686

In [12]:
df.tail(2) # mentioning the number will show that particular number of records

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
4246,10/01/2003,Central,Wisconsin,Small Market,Tea,Earl Grey,Regular,455,0,243,192,321,169,2297,0,162,296,115
4247,10/01/2003,Central,Wisconsin,Small Market,Smoothie,Lemon,Decaf,389,170,219,174,93,47,3279,192,213,280,105

In [13]:
df.tail() # tail gives the last records

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
4243,10/01/2003,Central,Wisconsin,Small Market,Tea,Darjeeling,Regular,341,88,220,146,128,50,1493,137,168,227,62
4244,10/01/2003,Central,Wisconsin,Small Market,Espresso,Decaf Espresso,Decaf,177,33,92,83,61,23,1972,178,186,235,68
4245,10/01/2003,Central,Wisconsin,Small Market,Coffee,Decaf Irish Cream,Decaf,683,235,395,262,182,86,1904,340,396,593,273
4246,10/01/2003,Central,Wisconsin,Small Market,Tea,Earl Grey,Regular,455,0,243,192,321,169,2297,0,162,296,115
4247,10/01/2003,Central,Wisconsin,Small Market,Smoothie,Lemon,Decaf,389,170,219,174,93,47,3279,192,213,280,105

In [15]:
# in case there is no columns avalable in the dataset

pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Demo_scv.csv",header=None)

      0      1        2       3   4    5          6
0   152  South  Perfume   Minor  55   54  04-Jun-01
1   153  South  Shampoo   Minor  12  234  21-May-02
2   154   East     Soap   Minor  61   64  22-May-02
3   155  South     Soap  Meager  88   86  27-Oct-03
4   156   West     Soap   Minor  72   77  27-Jul-00
..  ...    ...      ...     ...  ..  ...        ...
94  246  North     Soap   Major  27  142  03-Feb-00
95  247   West     Soap   Minor  59   91  10-Jan-00
96  248  South      Tea   Minor  69   58  09-Nov-03
97  249   East  Perfume   Major  96  195  13-Dec-01
98  250   East   Coffee   Minor  95   24  27-Aug-00

[99 rows x 7 columns]

In [20]:
# in case we want to gives our own column names 

pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Demo_scv.csv",names= ['A','B','C','D','E','F','G'])

      A      B        C       D   E    F          G
0   152  South  Perfume   Minor  55   54  04-Jun-01
1   153  South  Shampoo   Minor  12  234  21-May-02
2   154   East     Soap   Minor  61   64  22-May-02
3   155  South     Soap  Meager  88   86  27-Oct-03
4   156   West     Soap   Minor  72   77  27-Jul-00
..  ...    ...      ...     ...  ..  ...        ...
94  246  North     Soap   Major  27  142  03-Feb-00
95  247   West     Soap   Minor  59   91  10-Jan-00
96  248  South      Tea   Minor  69   58  09-Nov-03
97  249   East  Perfume   Major  96  195  13-Dec-01
98  250   East   Coffee   Minor  95   24  27-Aug-00

[99 rows x 7 columns]

In [21]:
# we cannot have duplicate column names
# we can also use number for column names

In [22]:
pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Coffee_Chain.csv").head()

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
0,02/01/2002,West,California,Major Market,Coffee,Amaretto,Regular,441,-87,86,305,158,102,1986,-61,101,456,402
1,02/01/2002,West,California,Major Market,Espresso,Caffe Latte,Regular,1527,477,737,647,267,213,4492,478,685,1212,686
2,02/01/2002,West,California,Major Market,Espresso,Caffe Mocha,Regular,898,83,513,350,436,360,2048,89,458,775,312
3,02/01/2002,West,California,Major Market,Smoothie,Chocolate,Decaf,681,322,451,285,107,83,2309,332,350,667,263
4,02/01/2002,West,California,Major Market,Coffee,Columbian,Regular,2064,786,1164,776,471,257,6601,1056,1494,2694,930

In [26]:
# in case we need to skip rows in the dataset
# 0 comes for column names

pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Coffee_Chain.csv",skiprows=[2,4]).head()

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
0,02/01/2002,West,California,Major Market,Coffee,Amaretto,Regular,441,-87,86,305,158,102,1986,-61,101,456,402
1,02/01/2002,West,California,Major Market,Espresso,Caffe Mocha,Regular,898,83,513,350,436,360,2048,89,458,775,312
2,02/01/2002,West,California,Major Market,Coffee,Columbian,Regular,2064,786,1164,776,471,257,6601,1056,1494,2694,930
3,02/01/2002,West,California,Major Market,Tea,Darjeeling,Regular,703,327,444,299,120,78,2306,286,307,528,201
4,02/01/2002,West,California,Major Market,Espresso,Decaf Espresso,Decaf,1843,578,869,770,323,233,4047,611,1008,1507,617

In [29]:
# To get the rows with certain words as NA values
# If we want to treat some values as NA values 

pd.read_csv(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/Coffee_Chain.csv",na_values=["Coffee"])

,Date,Market,State,Market Size,Product Type,Product,Type,Sales,Profit,Margin,COGS,Total Expenses,Marketing,Inventory,Budget Profit,Budget Margin,Budget Sales,Budget COGS
0,02/01/2002,West,California,Major Market,NaN,Amaretto,Regular,441,-87,86,305,158,102,1986,-61,101,456,402
1,02/01/2002,West,California,Major Market,Espresso,Caffe Latte,Regular,1527,477,737,647,267,213,4492,478,685,1212,686
2,02/01/2002,West,California,Major Market,Espresso,Caffe Mocha,Regular,898,83,513,350,436,360,2048,89,458,775,312
3,02/01/2002,West,California,Major Market,Smoothie,Chocolate,Decaf,681,322,451,285,107,83,2309,332,350,667,263
4,02/01/2002,West,California,Major Market,NaN,Columbian,Regular,2064,786,1164,776,471,257,6601,1056,1494,2694,930
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4243,10/01/2003,Central,Wisconsin,Small Market,Tea,Darjeeling,Regular,341,88,220,146,128,50,1493,137,168,227,62
4244,10/01/2003,Central,Wisconsin,Small Market,Espresso,Decaf Espresso,Decaf,177,33,92,83,61,23,1972,178,186,235,68
4245,10/01/2003,Central,Wisconsin,Small Market,NaN,Decaf Irish Cream,Decaf,683,235,395,262,182,86,1904,340,396,593,273
4246,10/01/2003,Central,Wisconsin,Small Market,Tea,Earl Grey,Regular,455,0,243,192,321,169,2297,0,162,296,115
4247,10/01/2003,Central,Wisconsin,Small Market,Smoothie,Lemon,Decaf,389,170,219,174,93,47,3279,192,213,280,105

In [ ]:
# Shift + Tab to see the documentation

In [30]:
# To read an excel using pandas

pd.read_excel(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/file_example_XLSX_1000.xlsx")

,Unnamed: 0,First Name,Last Name,Gender,Country,Age,Date,Id
0,1,Dulce,Abril,Female,United States,32,15/10/2017,1562
1,2,Mara,Hashimoto,Female,Great Britain,25,16/08/2016,1582
2,3,Philip,Gent,Male,France,36,21/05/2015,2587
3,4,Kathleen,Hanner,Female,United States,25,15/10/2017,3549
4,5,Nereida,Magwood,Female,United States,58,16/08/2016,2468
...,...,...,...,...,...,...,...,...
995,996,Roma,Lafollette,Female,United States,34,15/10/2017,2654
996,997,Felisa,Cail,Female,United States,28,16/08/2016,6525
997,998,Demetria,Abbey,Female,United States,32,21/05/2015,3265
998,999,Jeromy,Danz,Male,United States,39,15/10/2017,3265
999,1000,Rasheeda,Alkire,Female,United States,29,16/08/2016,6125

In [33]:
# To skip the column Unnamed : 0

pd.read_excel(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/file_example_XLSX_1000.xlsx",index_col=0)

     First Name   Last Name  Gender        Country  Age        Date    Id
1         Dulce       Abril  Female  United States   32  15/10/2017  1562
2          Mara   Hashimoto  Female  Great Britain   25  16/08/2016  1582
3        Philip        Gent    Male         France   36  21/05/2015  2587
4      Kathleen      Hanner  Female  United States   25  15/10/2017  3549
5       Nereida     Magwood  Female  United States   58  16/08/2016  2468
...         ...         ...     ...            ...  ...         ...   ...
996        Roma  Lafollette  Female  United States   34  15/10/2017  2654
997      Felisa        Cail  Female  United States   28  16/08/2016  6525
998    Demetria       Abbey  Female  United States   32  21/05/2015  3265
999      Jeromy        Danz    Male  United States   39  15/10/2017  3265
1000   Rasheeda      Alkire  Female  United States   29  16/08/2016  6125

[1000 rows x 7 columns]

In [35]:
# To choose the sheet in the excel workbook

pd.read_excel(r"C:/Users/KARTHIKRAGHAVAN/Desktop/Ineuron/Datasets/file_example_XLSX_1000.xlsx",sheet_name='Demo_sheet')

   A  B    C  D
0  0  1  NaN -5
1  0  1  0.0  5
2  0  1  2.0  2
3  0  1  4.0  0

In [38]:
# To get tabular data from web page (html extension)
# https://www.basketball-reference.com/leaders/
# https://www.basketball-reference.com/leaders/orb_top_10.html

html_data = pd.read_html('https://www.basketball-reference.com/leaders/orb_top_10.html')[0]

In [40]:
type(html_data)

pandas.core.frame.DataFrame

In [41]:
type(pd.read_html('https://www.basketball-reference.com/leaders/orb_top_10.html'))

list

In [45]:
demon_slayer = pd.read_html('https://en.wikipedia.org/wiki/Demon_Slayer:_Kimetsu_no_Yaiba')

In [68]:
len(demon_slayer) # There are 18 different tables on the page

18

In [66]:
demon_slayer[0]

,0,1
0,Demon Slayer: Kimetsu no Yaiba,Demon Slayer: Kimetsu no Yaiba
1,"First tankōbon volume cover, featuring sibling...","First tankōbon volume cover, featuring sibling..."
2,鬼滅の刃(Kimetsu no Yaiba),鬼滅の刃(Kimetsu no Yaiba)
3,Genre,Adventure[1]Dark fantasy[2]Martial arts[3]
4,Manga,Manga
5,Written by,Koyoharu Gotouge
6,Published by,Shueisha
7,English publisher,NA Viz Media
8,Imprint,Jump Comics
9,Magazine,Weekly Shōnen Jump
10,English magazine,NA Weekly Shonen Jump
11,Demographic,Shōnen
12,Original run,"February 15, 2016 – May 18, 2020"
13,Volumes,23 (List of volumes)
14,Anime television series,Anime television series
15,Directed by,Haruo Sotozaki
16,Produced by,Akifumi FujioMasanori MiyakeYūma TakahashiHika...
17,Written by,Ufotable
18,Music by,Yuki KajiuraGo Shiina
19,Studio,Ufotable
20,Licensed by,AUS Madman EntertainmentBI Anime LimitedNA Ani...
21,Original network,"Fuji TV, KTV, Tokyo MX, GTV, GYT, BS11"
22,English network,US Adult Swim (Toonami)
23,Original run,"April 6, 2019 – present"
24,Episodes,44 (List of episodes)
25,Anime film,Anime film
26,Demon Slayer: Kimetsu no Yaiba – The Movie: Mu...,Demon Slayer: Kimetsu no Yaiba – The Movie: Mu...
27,Video games,Video games
28,Demon Slayer: Kimetsu no Yaiba – The Hinokami ...,Demon Slayer: Kimetsu no Yaiba – The Hinokami ...

In [72]:
# For Raw data in Github
#in case if it is seperated by tab, we need to use sep = '\t'

pd.read_csv(r'https://raw.githubusercontent.com/abhishekchhibber/Titanic-Data-Visualization/master/titanic_dataset.tsv',sep = '\t')

,PassengerId,sur_status,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_total,ifSurvived,passenger_class,survival_status,embarkation_port
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,No,3rd,Perished,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Yes,1st,Survived,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Yes,3rd,Survived,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Yes,1st,Survived,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,No,3rd,Perished,Southampton
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,No,2nd,Perished,Southampton
885,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,Yes,1st,Survived,Southampton
886,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,No,3rd,Perished,Southampton
887,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,Yes,1st,Survived,Cherbourg
888,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,No,3rd,Perished,Queenstown

In [75]:
# dtypes gives data type for each column

df.dtypes

Date              object
Market            object
State             object
Market Size       object
Product Type      object
Product           object
Type              object
Sales              int64
Profit             int64
Margin             int64
COGS               int64
Total Expenses     int64
Marketing          int64
Inventory          int64
Budget Profit      int64
Budget Margin      int64
Budget Sales       int64
Budget COGS        int64
dtype: object

In [77]:
# To get the columns names of the dataframe

df.columns

Index(['Date', 'Market', 'State', 'Market Size', 'Product Type', 'Product',
       'Type', 'Sales', 'Profit', 'Margin', 'COGS', 'Total Expenses',
       'Marketing', 'Inventory', 'Budget Profit', 'Budget Margin',
       'Budget Sales', 'Budget COGS'],
      dtype='object')

In [83]:
# retrieving one column --> Series
# Series is similar to List data structure

df['Product']

0                Amaretto
1             Caffe Latte
2             Caffe Mocha
3               Chocolate
4               Columbian
              ...
4243           Darjeeling
4244       Decaf Espresso
4245    Decaf Irish Cream
4246            Earl Grey
4247                Lemon
Name: Product, Length: 4248, dtype: object

In [86]:
# retrieving multiple column --> Dataframe

df[['Product','State']]

                Product       State
0              Amaretto  California
1           Caffe Latte  California
2           Caffe Mocha  California
3             Chocolate  California
4             Columbian  California
...                 ...         ...
4243         Darjeeling   Wisconsin
4244     Decaf Espresso   Wisconsin
4245  Decaf Irish Cream   Wisconsin
4246          Earl Grey   Wisconsin
4247              Lemon   Wisconsin

[4248 rows x 2 columns]

In [88]:
# Task 1
# we need to dump the below data into Mysql and Mongo DB Atlas

pd.read_csv(r'https://raw.githubusercontent.com/abhishekchhibber/Titanic-Data-Visualization/master/titanic_dataset.tsv',sep = '\t')

,PassengerId,sur_status,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Embarked_total,ifSurvived,passenger_class,survival_status,embarkation_port
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,No,3rd,Perished,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,Yes,1st,Survived,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,Yes,3rd,Survived,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,Yes,1st,Survived,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,No,3rd,Perished,Southampton
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,1,No,2nd,Perished,Southampton
885,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1,Yes,1st,Survived,Southampton
886,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,1,No,3rd,Perished,Southampton
887,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1,Yes,1st,Survived,Cherbourg
888,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,1,No,3rd,Perished,Queenstown

# 10th July Pandas - II